; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v5)
             (pred_8 ?v10 ?v6)
             (pred_2 ?v8 ?v6)
             (pred_3 ?v11 ?v8 )
	     (pred_10 ?v8)
             (pred_12 ?v9)
             (pred_7 ?v10)
             (pred_1 ?v6)
             (pred_11 ?v8)
             (pred_4 ?v10)
             (pred_9 ?v8)
             (pred_5 ))



(:action op_5
:parameters (?v7 ?v2 ?v13 ?v4)
:precondition (and (pred_12 ?v7) (pred_12 ?v2) (pred_7 ?v13) (pred_1 ?v4)
          (pred_6 ?v7 ?v2) (pred_8 ?v13 ?v4)
                   (pred_2 ?v2 ?v4) (pred_10 ?v7) 
                   (pred_11 ?v2) (pred_4 ?v13))
:effect (and  (pred_9 ?v2) (not (pred_11 ?v2))))


(:action op_1
:parameters (?v7 ?v1)
:precondition (and (pred_12 ?v7) (pred_12 ?v1)
               (pred_10 ?v7) (pred_6 ?v7 ?v1) (pred_9 ?v1))
:effect (and (pred_10 ?v1) (not (pred_10 ?v7))))

(:action op_2
:parameters (?v7 ?v13)
:precondition (and (pred_12 ?v7) (pred_7 ?v13) 
                  (pred_10 ?v7) (pred_3 ?v13 ?v7) (pred_5 ))
:effect (and (pred_4 ?v13)
   (not (pred_3 ?v13 ?v7)) (not (pred_5 ))))


(:action op_4
:parameters (?v7 ?v3 ?v12)
:precondition (and (pred_12 ?v7) (pred_7 ?v3) (pred_7 ?v12)
                  (pred_10 ?v7) (pred_4 ?v12) (pred_3 ?v3 ?v7))
:effect (and (pred_4 ?v3) (pred_3 ?v12 ?v7)
        (not (pred_4 ?v12)) (not (pred_3 ?v3 ?v7))))

(:action op_3
:parameters (?v7 ?v13)
:precondition (and (pred_12 ?v7) (pred_7 ?v13) 
                  (pred_10 ?v7) (pred_4 ?v13))
:effect (and (pred_5 ) (pred_3 ?v13 ?v7) (not (pred_4 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_04 obj_15 obj_09 obj_03 obj_17 obj_13 obj_06 obj_11 obj_05 obj_18 obj_20 obj_19 obj_16 obj_12 obj_10
    obj_14 obj_08
    obj_02 obj_01
    )

    (:init
       (pred_5)

       (pred_12 obj_07)
       (pred_12 obj_04)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_13)
       (pred_12 obj_06)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_1 obj_14)
       (pred_1 obj_08)
       (pred_7 obj_02)
       (pred_7 obj_01)

       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_04 obj_17)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_15 obj_13)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_17 obj_13)
       (pred_6 obj_17 obj_04)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_15)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_11 obj_19)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_05 obj_16)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_11)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_16 obj_05)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_10 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_05)
       (pred_2  obj_04 obj_14)
       (pred_2  obj_05 obj_08)
       (pred_9 obj_07)
       (pred_9 obj_15)
       (pred_9 obj_09)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_13)
       (pred_9 obj_06)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_16)
       (pred_9 obj_12)
       (pred_9 obj_10)

       (pred_8  obj_02 obj_14)
       (pred_8  obj_01 obj_08)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_01 obj_18)
       (pred_10 obj_20)
    )

    (:goal (and
       (pred_3 obj_02 obj_04)
    ))
(:constraints
  (always (not (pred_10 obj_06)))
)
)

; plan
1. (op_1 obj_20 obj_18)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_18)
   goals met: 0 of 1
2. (op_1 obj_18 obj_13)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_15)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_15)
   goals met: 0 of 1
4. (op_2 obj_15 obj_02)
   deleted: (pred_3 obj_02 obj_15) (pred_5)
   added: (pred_4 obj_02)
   goals met: 0 of 1
5. (op_5 obj_15 obj_04 obj_02 obj_14)
   deleted: (pred_11 obj_04)
   added: (pred_9 obj_04)
   goals met: 0 of 1
6. (op_1 obj_15 obj_04)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_04)
   goals met: 0 of 1
7. (op_3 obj_04 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_5) (pred_3 obj_02 obj_04)
   goals met: 1 of 1
